<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0f7453f192b10aa86271f8bc1612bcfe60b80efe9379566ab22a76086b25a4d6","plan_job_ref":"Job Plan #14 at https://github.com/ExpidusOS/infra/actions/runs/5887152741","plan_hash":"c62716d77ff02e1aa547f991aa7f20c8632cb198ff536d27b16c15928416dcfe","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.12.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.gitlab-operator will be created
  + resource "helm_release" "gitlab-operator" {
      + atomic                     = false
      + chart                      = "gitlab-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gitlab-operator"
      + namespace                  = "gitlab-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://gitlab.com/api/v4/projects/18899486/packages/helm/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.22.4"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # kubectl_manifest.gitlab will be created
  + resource "kubectl_manifest" "gitlab" {
      + api_version             = "apps.gitlab.com/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "GitLab"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gitlab"
      + namespace               = "gitlab-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps.gitlab.com/v1beta1
            kind: GitLab
            metadata:
              name: gitlab
              namespace: gitlab-system
            spec:
              chart:
                values:
                  certmanager-issuer:
                    email: inquiry@midstall.com
                  gitlab:
                    gitaly:
                      persistence:
                        size: 10Gi
                    toolbox:
                      backups:
                        objectStorage:
                          config:
                            key: config
                            secret: gitlab-wasabi-secret
                  global:
                    appConfig:
                      artifacts:
                        bucket: expidusos-gitlab-artifacts-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      backups:
                        bucket: expidusos-gitlab-backups-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      lfs:
                        bucket: expidusos-gitlab-lfs-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      object_store:
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      packages:
                        bucket: expidusos-gitlab-packages-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      uploads:
                        bucket: expidusos-gitlab-uploads-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                    hosts:
                      domain: gitlab.expidusos.com
                    ingress:
                      configureCertmanager: true
                    minio:
                      enabled: false
                  postgresql:
                    persistence:
                      size: 5Gi
                  redis:
                    master:
                      persistence:
                        size: 5Gi
                version: 7.2.4
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_namespace.gitlab will be created
  + resource "kubernetes_namespace" "gitlab" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "gitlab"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.gitlab-wasabi-secret will be created
  + resource "kubernetes_secret" "gitlab-wasabi-secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "gitlab-wasabi-secret"
          + namespace        = "gitlab"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan #14](https://github.com/ExpidusOS/infra/actions/runs/5887152741)